9/data/attachments/7e2fe268f6d806d4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_820e7bf3-842a-4ec0-b85a-397ac4407f7d</nif:username>
            <nif:friendToBeAdded>Rhonda_statement_Friend_79482_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>